/**
 * List of 31 provinces in Iran with Khuzestan first as default.
 */
export const IRANIAN_PROVINCES = [
  'خوزستان',
  'تهران',
  'آذربایجان شرقی',
  'آذربایجان غربی',
  'اردبیل',
  'اصفهان',
  'البرز',
  'ایلام',
  'بوشهر',
  'چهارمحال و بختیاری',
  'خراسان جنوبی',
  'خراسان رضوی',
  'خراسان شمالی',
  'زنجان',
  'سمنان',
  'سیستان و بلوچستان',
  'فارس',
  'قزوین',
  'قم',
  'کردستان',
  'کرمان',
  'کرمانشاه',
  'کهگیلویه و بویراحمد',
  'گلستان',
  'گیلان',
  'لرستان',
  'مازندران',
  'مرکزی',
  'هرمزگان',
  'همدان',
  'یزد',
] as const

export type IranianProvince = (typeof IRANIAN_PROVINCES)[number]

/**
 * Standard list of Iranian banks with Bank Melli first as default.
 */
export const IRANIAN_BANKS = [
  'ملی',
  'ملت',
  'صادرات',
  'تجارت',
  'سپه',
  'کشاورزی',
  'مسکن',
  'رفاه کارگران',
  'سامان',
  'پارسیان',
  'پاسارگاد',
  'اقتصاد نوین',
  'شهر',
  'سینا',
  'دی',
  'کارآفرین',
  'خاورمیانه',
  'سرمایه',
  'گردشگری',
  'ایران زمین',
  'آینده',
  'پست بانک',
  'توسعه تعاون',
  'صنعت و معدن',
  'توسعه صادرات',
  'قرض‌الحسنه مهر ایران',
  'قرض‌الحسنه رسالت',
] as const

export type IranianBank = (typeof IRANIAN_BANKS)[number]
